[
  {
    "title": "Smokey Chicken Thighs with Yellow Rice",
    "difficulty": "4",
    "time": "25",
    "details": {
      "ingredients": [
        {
          "name": "Turmeric",
          "amount": "1 teaspoon",
          "type": "Essential"
        },
        {
          "name": "White Rice",
          "amount": "3/4 cup",
          "type": "Essential"
        },
        {
          "name": "Small Tomato",
          "amount": "1",
          "type": "Optional"
        },
        {
          "name": "Garlic",
          "amount": "1 clove",
          "type": "Essential"
        },
        {
          "name": "Cilantro",
          "amount": "1/4 ounce",
          "type": "Optional"
        },
        {
          "name": "Peas",
          "amount": "4 ounces",
          "type": "Optional"
        },
        {
          "name": "Smoked Paprika",
          "amount": "1 teaspoon",
          "type": "Essential"
        },
        {
          "name": "Chicken Stock Concentrate",
          "amount": "3 teaspoons",
          "type": "Essential"
        },
        {
          "name": "Red Onion",
          "amount": "1",
          "type": "Optional"
        },
        {
          "name": "Lemon",
          "amount": "1",
          "type": "Optional"
        },
        {
          "name": "Diced Chicken Thighs",
          "amount": "10 ounces",
          "type": "Essential"
        },
        {
          "name": "Cooking Oil",
          "amount": "2 teaspoon",
          "type": "Essential"
        },
        {
          "name": "Salt",
          "amount": "1",
          "type": "Essential"
        },
        {
          "name": "Pepper",
          "amount": "1",
          "type": "Essential"
        },
        {
          "name": "Sugar",
          "amount": "1/2 teaspoon",
          "type": "Optional"
        }
      ],
      "instructions": [
        "Heat a drizzle of oil in a small pot over medium heat. Add half the turmeric (all for 4 servings) and half the smoked paprika (you’ll use the rest later); cook, stirring occasionally, until fragrant, 30 seconds. • Add rice, stock concentrates, 1¼ cups water (2¼ cups for 4), and a pinch of salt. Bring to a boil, then cover and reduce to a low simmer. Cook until rice is tender, 15-20 minutes. Keep covered off heat until ready to use in Step 5.",
        "While rice cooks, wash and dry produce. • Halve, peel, and thinly slice half the onion (whole onion for 4 servings). Halve lemon. Dice tomato into ½-inch pieces. Peel and mince or grate garlic. Pick cilantro leaves from stems.",
        "In a small microwave-safe bowl, combine sliced onion, ½ tsp sugar, juice from half the lemon, and a pinch of salt (1 tsp sugar and juice from whole lemon for 4 servings). • Cover with plastic wrap and microwave until onion is softened, 30-60 seconds. Set aside.",
        "Open package of chicken* and drain off any excess liquid. • Heat a drizzle of oil in a large pan over medium-high heat. Add chicken in an even layer; season with remaining smoked paprika, salt, and pepper. Cook, undisturbed, until lightly browned on the bottom, 2-3 minutes. • Add tomato and garlic; continue to cook, stirring occasionally, until chicken is cooked through and tomato is slightly softened, 3-5 minutes more.",
        "Fluff rice with a fork. • To pan with chicken, add rice and peas; stir to combine. Taste and season with salt if desired.",
        "Divide chicken and rice between shallow bowls. Top with cilantro leaves and as much pickled onion (draining first) as you like. Serve.\r\n\r\nChicken is fully cooked when internal temperature reaches 165°."
      ]
    },
    "about": "A spin on arroz con pollo (“rice with chicken”) is just another entry into the upper echelon of iconic duos. Ready in just 30 minutes, you’ll season and sizzle chicken thighs with smoky paprika, then arrange them on a bed of fluffy rice tinged with earthy turmeric and dotted with peas. Piquant pickled red onions and fragrant cilantro add further pops of freshness to this hearty, classic meal. Serving amount is 2 dishes.",
    "id": 1,
    "image": {
      "filename": "recipe_4.jpeg",
      "type": "image/jpeg"
    }
  }
]