[{"title":"Smokey Chicken Thighs with Yellow Rice","difficulty":"4","time":"25","details":{"ingredients":[{"name":"Turmeric","amount":"1 teaspoon","type":"Essential"},{"name":"White Rice","amount":"3/4 cup","type":"Essential"},{"name":"Small Tomato","amount":"1","type":"Optional"},{"name":"Garlic","amount":"1 clove","type":"Essential"},{"name":"Cilantro","amount":"1/4 ounce","type":"Optional"},{"name":"Peas","amount":"4 ounces","type":"Optional"},{"name":"Smoked Paprika","amount":"1 teaspoon","type":"Essential"},{"name":"Chicken Stock Concentrate","amount":"3 teaspoons","type":"Essential"},{"name":"Red Onion","amount":"1","type":"Optional"},{"name":"Lemon","amount":"1","type":"Optional"},{"name":"Diced Chicken Thighs","amount":"10 ounces","type":"Essential"},{"name":"Cooking Oil","amount":"2 teaspoon","type":"Essential"},{"name":"Salt","amount":"1","type":"Essential"},{"name":"Pepper","amount":"1","type":"Essential"},{"name":"Sugar","amount":"1/2 teaspoon","type":"Optional"}],"instructions":["Heat a drizzle of oil in a small pot over medium heat. Add half the turmeric (all for 4 servings) and half the smoked paprika (you’ll use the rest later); cook, stirring occasionally, until fragrant, 30 seconds. • Add rice, stock concentrates, 1¼ cups water (2¼ cups for 4), and a pinch of salt. Bring to a boil, then cover and reduce to a low simmer. Cook until rice is tender, 15-20 minutes. Keep covered off heat until ready to use in Step 5.","While rice cooks, wash and dry produce. • Halve, peel, and thinly slice half the onion (whole onion for 4 servings). Halve lemon. Dice tomato into ½-inch pieces. Peel and mince or grate garlic. Pick cilantro leaves from stems.","In a small microwave-safe bowl, combine sliced onion, ½ tsp sugar, juice from half the lemon, and a pinch of salt (1 tsp sugar and juice from whole lemon for 4 servings). • Cover with plastic wrap and microwave until onion is softened, 30-60 seconds. Set aside.","Open package of chicken* and drain off any excess liquid. • Heat a drizzle of oil in a large pan over medium-high heat. Add chicken in an even layer; season with remaining smoked paprika, salt, and pepper. Cook, undisturbed, until lightly browned on the bottom, 2-3 minutes. • Add tomato and garlic; continue to cook, stirring occasionally, until chicken is cooked through and tomato is slightly softened, 3-5 minutes more.","Fluff rice with a fork. • To pan with chicken, add rice and peas; stir to combine. Taste and season with salt if desired.","Divide chicken and rice between shallow bowls. Top with cilantro leaves and as much pickled onion (draining first) as you like. Serve.\r\n\r\nChicken is fully cooked when internal temperature reaches 165°."]},"about":"A spin on arroz con pollo (“rice with chicken”) is just another entry into the upper echelon of iconic duos. Ready in just 30 minutes, you’ll season and sizzle chicken thighs with smoky paprika, then arrange them on a bed of fluffy rice tinged with earthy turmeric and dotted with peas. Piquant pickled red onions and fragrant cilantro add further pops of freshness to this hearty, classic meal. Serving amount is 2 dishes.","id":1,"image":{"filename":"recipe_1.jpeg","type":"image/jpeg"}},{"title":"Garlicky Fried Chicken Sandwiches","difficulty":"6","time":"35","details":{"ingredients":[{"name":"Carrots","amount":"12 oz","type":"Alternatives","Alternatives":[{"name":"Asparagus","amount":"6 oz"}]},{"name":"Potato Buns","amount":"2 pairs","type":"Essential"},{"name":"Panko Breadcrumbs","amount":"1/2 cup","type":"Essential"},{"name":"Garlic Powder","amount":"1 tsp","type":"Essential"},{"name":"Chicken Cutlets","amount":"10 oz","type":"Essential"},{"name":"Sour Cream","amount":"1 1/2 tbsp","type":"Essential"},{"name":"Mayonnaise","amount":"2 tbsp","type":"Essential"},{"name":"Honey Dijon Dressing","amount":"1.5 oz","type":"Essential"},{"name":"Hot Sauce","amount":"1 tsp","type":"Optional"},{"name":"Olive Oil","amount":"2 tsp","type":"Essential"},{"name":"Cooking Oil","type":"Essential"},{"name":"Salt","type":"Essential"},{"name":"Pepper","type":"Essential"}],"instructions":["Adjust rack to top position and preheat oven to 425 degrees. Wash and dry produce. • Trim, peel, and cut carrots into sticks (like fries; ours were 3 inches long and 1/3 inch thick). Halve buns. • In a shallow dish, combine panko, garlic powder, salt (we used 1 tsp; 2 tsp for 4 servings), and pepper. For asparagus, trim and discard woody bottom ends.","Toss carrots, or asparagus, on a baking sheet with a large drizzle of olive oil. Season generously with salt and pepper. • Roast on top rack until tender, 15-20 minutes.","Pat chicken dry with paper towels; place between two large pieces of plastic wrap. Pound with a mallet or rolling pin until chicken is about ½ inch thick. Season all over with salt and pepper. • Brush chicken all over with sour cream. Working one piece at a time, press chicken into panko mixture until fully coated on both sides.","Heat a 1/3-inch layer of oil in a large, heavy-bottomed pan over medium-high heat. Once oil is hot enough that a pinch of panko mixture sizzles when added to the pan, add coated chicken. Cook until crust is golden brown and chicken is cooked through, 3-5 minutes per side. (TIP: Fry in batches if necessary; lower heat if chicken begins to brown too quickly.) Transfer chicken to a paper-towel-lined plate."," In a small bowl, whisk together mayonnaise, honey Dijon dressing, and hot sauce to taste (we used the whole packet). Season with salt and pepper. • Toast buns until golden brown.","Spread top buns with as much honey mustard mayo as you like. Fill buns with chicken. • Divide sandwiches and carrots, or asparagus, between plates. Serve with any remaining honey mustard mayo on the side for dipping."]},"about":"Think you need a fancy meal to really treat your tastebuds? These fried chicken sandwiches beg to differ! Chicken cutlets are spread with sour cream, coated in garlicky panko, and fried until golden and crispy. Toasted buns are stuffed with chicken and a layer of spicy honey-mustard mayo, and the rest of that tangy-sweet dipper is served on the side with roasted carrot fries. It’s casual, downhome comfort food at its finger lickin’ finest!","id":2,"image":{"filename":"recipe_2.jpeg","type":"image/jpeg"}},{"title":"Creamy Dil Pork Filet","difficulty":"3","time":"35","details":{"ingredients":[{"name":"Green Beans","amount":"6 oz","type":"Essential"},{"name":"Dill","amount":"1/4 oz","type":"Optional"},{"name":"Pork Fillet","amount":"2 fillets, 5 oz each","type":"Alternatives","Alternatives":[{"name":"Chicken Cutlets","amount":"2 cutlets, 5 oz each"}]},{"name":"Chili Flakes","amount":"1 tsp","type":"Optional"},{"name":"Couscous","amount":"2.5 oz","type":"Essential"},{"name":"Chicken Stock Concentrates","amount":"2 tsp","type":"Essential"},{"name":"Sour Cream","amount":"3 tbsp","type":"Essential"},{"name":"Dijon Mustard","amount":"2 tsp","type":"Essential"},{"name":"Salt","amount":"1","type":"Essential"},{"name":"Pepper","amount":"1","type":"Essential"},{"name":"Olive Oil","amount":"1 tbsp","type":"Essential"},{"name":"Butter","amount":"2 tbsp","type":"Essential"}],"instructions":["Adjust rack to top position and preheat oven to 425 degrees. Line a baking sheet with foil. Wash and dry produce. • Trim green beans if necessary. Pick and roughly chop fronds from dill.","Pat pork dry with paper towels; season generously with salt and pepper. • Heat a large drizzle of olive oil in a large pan over medium-high heat. Add pork and sear, turning occasionally, until browned all over, 4-8 minutes (it’ll finish cooking in the next step). • Turn off heat; transfer pork to one side of prepared baking sheet.\r\n\r\nSwap in chicken for pork. Cook until browned and cooked through 3-5 minutes per side. Transfer to a cutting board to rest.","Add green beans to empty side of baking sheet; toss with a drizzle of olive oil, salt, pepper, and chili flakes to taste. • Roast on top rack until green beans are tender and pork is cooked through, 12-15 minutes. • Remove from oven; transfer pork to a cutting board to rest for 5 minutes.\r\n\r\nIf using chicken, don't put in over. Spread green beans out across entire sheet; roast as instructed.","Meanwhile, add couscous and 1 TBSP butter (2 TBSP for 4 servings) to a small pot over medium-high heat. Cook, stirring, until butter has melted and couscous is lightly toasted, 2-3 minutes. • Add ¾ cup water (1½ cups for 4), half the stock concentrates (you’ll use more in the next step), and a big pinch of salt. Bring to a boil, then cover and reduce to a low simmer. Cook until couscous is tender, 6-8 minutes. TIP: Drain excess water if necessary. • Keep covered off heat until ready to serve.","While couscous cooks, heat pan used for pork over medium-high heat. Add remaining stock concentrate and ¼ cup water (1/3 cup for 4 servings); bring to a simmer and cook 1-2 minutes. • Reduce heat to low and whisk in sour cream, half the chopped dill, and mustard to taste. Turn off heat. Stir in 1 TBSP butter (2 TBSP for 4) and any resting juices from pork. Season with salt and pepper.","Fluff couscous with a fork and season with salt and pepper. • Slice pork crosswise. • Divide couscous, pork, and green beans between plates. Spoon sauce over pork and sprinkle with remaining chopped dill and any remaining chili flakes to taste. Serve."]},"about":"Serves 2. Another work day, another dinner daydream. You know what we mean. You’re sitting at your desk and 2:00 p.m. rolls around. Suddenly, all you can think is, “Dinner...what the heck am I going to eat for dinner?!” Well, we’ve got you covered, and FYI, the answer to that question is pretty darn delicious. We’re serving up succulent pork tenderloin with roasted green beans and savory couscous. To finish things off, the pork is drizzled with a life-affirming creamy dill sauce. Talk about a dream come true!","id":3,"image":{"filename":"recipe_3.jpeg","type":"image/jpeg"}},{"title":"Honey Thyme Pork Filet","difficulty":"4","time":"40","details":{"ingredients":[{"name":"Potatoes","amount":"12 oz","type":"Essential"},{"name":"Garlic","amount":"1 clove","type":"Essential"},{"name":"Dried Thyme","amount":"1 tsp","type":"Optional"},{"name":"Honey","amount":"2 tsp","type":"Optional"},{"name":"Pork Filet","amount":"2 filets, 5 oz each","type":"Alternatives","Alternatives":[{"name":"Chicken Cutlets","amount":"2 cutlets, 5 oz each"}]},{"name":"Broccoli","amount":"8 oz","type":"Essential"},{"name":"Chicken Stock Concentrate","amount":"2 tsp","type":"Essential"},{"name":"Salt","amount":"1","type":"Essential"},{"name":"Pepper","amount":"1","type":"Essential"},{"name":"Cooking Oil","amount":"1 tbsp","type":"Essential"},{"name":"Olive Oil","amount":"1 tsp","type":"Essential"},{"name":"Butter","amount":"1 tbsp","type":"Essential"}],"instructions":["Adjust racks to top and middle positions and preheat oven to 450 degrees. Wash and dry produce. • Dice potatoes into 1⁄2-inch pieces. Toss on a baking sheet with a drizzle of oil, salt, and pepper. • Roast on top rack, tossing halfway through, until lightly browned and tender, 20-25 minutes.","While potatoes roast, pat pork dry with paper towels; season all over with salt and pepper. • Heat a drizzle of oil in a large pan over medium heat. Add pork and sear, turning occasionally, until browned all over, 4-8 minutes. • Meanwhile, peel and mince half the garlic (all for 4 servings). • Once pork is browned, transfer to one side of a second baking sheet.\r\n\r\nSwap in chicken for pork. Cook until browned and cooked through, 3-5 minutes per side. Transfer to a cutting board and tent with foil to keep warm. Don't transfer chicken to baking sheet.","Cut broccoli into bite-size pieces if necessary. Toss with a drizzle of olive oil and a pinch of salt and pepper on opposite side of baking sheet from pork.\r\n\r\nIf not using pork, spread broccoli out across entire baking sheet.","Transfer sheet with pork and broccoli to middle rack; roast until pork is cooked through and broccoli is tender, 12-15 minutes. • Once pork is done, transfer to a cutting board to rest. Thinly slice crosswise.","Heat a drizzle of oil in pan used for pork over medium heat. Add minced garlic and thyme; cook until fragrant, 30 seconds. • Stir in stock concentrates, honey, and 1⁄4 cup water (1/3 cup for 4 servings). Simmer, scraping up any browned bits from bottom of pan, until sauce has reduced and thickened, 2-3 minutes. • Stir in 1 TBSP butter (2 TBSP for 4) until melted. Season with salt and pepper. TIP: If sauce seems too thick, stir in a splash or two of water.","Divide pork, or chicken, broccoli, and potatoes between plates. Drizzle pork or chicken with sauce and serve."]},"about":"Serves 2. A honey-based sauce may sound like something that goes with dessert, but mild-tasting pork loves a sweet sauce too, especially one that has a few savory elements added to the mix. In this recipe, you’ll be folding an extra-large drizzle of honey into a rich, savory pan sauce, then spooning it onto pork tenderloin. (We recommend spooning it on the roasted potatoes and side of green beans, too!)","id":4,"image":{"filename":"recipe_4.jpeg","type":"image/jpeg"}},{"title":"Pork Sausage Rigatoni Rosa","difficulty":"3","time":"25","details":{"ingredients":[{"name":"Rigatoni Pasta","amount":"6 oz","type":"Essential"},{"name":"Zucchini","amount":"1 unit","type":"Essential"},{"name":"Garlic","amount":"1 clove","type":"Essential"},{"name":"Italian Pork Sausage","amount":"9 oz","type":"Alternatives","Alternatives":[{"name":"Chopped Chicken Breast","amount":"10 oz"},{"name":"Italian Chicken Sausage","amount":"9 oz"}]},{"name":"Tomato Paste","amount":"3 oz","type":"Essential"},{"name":"Cream Cheese","amount":"4 tbsp","type":"Essential"},{"name":"Chicken Stock Concentrate","amount":"1 tsp","type":"Essential"},{"name":"Chili Flakes","amount":"1 tsp","type":"Optional"},{"name":"Parmesan Cheese","amount":"6 tbsp","type":"Optional"},{"name":"Salt","amount":"1","type":"Essential"},{"name":"Pepper","amount":"1","type":"Essential"},{"name":"Cooking Oil","amount":"2 tsp","type":"Essential"},{"name":"Sugar","amount":"1/2 tsp","type":"Optional"},{"name":"Butter","amount":"1 tbsp","type":"Essential"}],"instructions":["Wash and dry produce. • Bring a large pot of salted water to a boil. Once water is boiling, add rigatoni; cook, stirring occasionally, until al dente, 9-11 minutes. • Reserve 1 cup pasta cooking water (1½ cups for 4 servings), then drain and set aside. • Meanwhile, trim and halve zucchini lengthwise; slice crosswise into ¼-inch-thick half-moons. Peel and mince or grate garlic.","While pasta cooks, heat a drizzle of oil in a large pan over medium-high heat. Add zucchini; season with salt and pepper. Cook, stirring occasionally, until browned and tender, 5-6 minutes. Remove pan from heat; transfer zucchini to a plate. • Remove sausage from casing if necessary; discard casing.  Heat another drizzle of oil in same pan over medium-high heat. Add sausage to pan and cook, breaking up meat into pieces, until almost cooked through, 3-4 minutes (it’ll finish cooking in the next step).\r\n\r\nIf using chicken, open package of chicken and drain off any excess liquid. Season with salt and pepper. Cook through this step as instructed, swapping in chicken or chicken sausage.","Stir garlic and tomato paste into pan with sausage; cook until garlic is fragrant, tomato paste is well distributed, and sausage is fully cooked, 1-2 minutes. • Stir in cream cheese, stock concentrate, ½ cup reserved pasta cooking water (ladle straight from the pot if pasta hasn’t finished cooking yet), 1 TBSP butter, ½ tsp sugar, and a pinch of chili flakes to taste. (For 4 servings, use ¾ cup pasta cooking water, 2 TBSP butter, and 1 tsp sugar.) Remove from heat.","Add drained rigatoni and zucchini to pan with sauce. Stir in half the Parmesan. Season with salt and pepper to taste. TIP: If needed, stir in more reserved pasta cooking water a splash at a time until pasta is coated in a creamy sauce. • Divide between bowls; top with remaining Parmesan and serve."]},"about":"Serves 2. Fun fact: “Rosa” means “pink” in Italian. For our chefs’ version of rigatoni rosa, you’ll make a homemade pink sauce with a savory sausage base and a sprinkle of chili flakes (for a little heat!). Toss that with rigatoni and sautéed zucchini, then sprinkle Parmesan all over and we promise: you’ll be blushing from all the compliments you receive on this meal.","id":5,"image":{"filename":"recipe_5.jpeg","type":"image/jpeg"}},{"title":"Cheesy Smashed Pork Burgers","difficulty":"7","time":"45","details":{"ingredients":[{"name":"Onion","amount":"1 unit","type":"Optional"},{"name":"Potatoes","amount":"12 oz","type":"Essential"},{"name":"Old Bay Seasoning","amount":"1 tbsp","type":"Optional"},{"name":"Mayonnaise","amount":"2 tbsp","type":"Essential"},{"name":"Ketchup","amount":"2 tbsp","type":"Optional"},{"name":"Dijon Mustard","amount":"2 tsp","type":"Optional"},{"name":"Ground Pork","amount":"10 oz","type":"Alternatives","Alternatives":[{"name":"Ground Pork","amount":"10 oz"}]},{"name":"White Cheddar Cheese","amount":"1/2 cup","type":"Essential"},{"name":"Potato Buns","amount":"2 sets","type":"Essential"},{"name":"salt","amount":"1","type":"Essential"},{"name":"pepper","amount":"1","type":"Essential"},{"name":"Cooking Oil","amount":"4 tsp","type":"Essential"},{"name":"Sugar","amount":"1 tsp","type":"Essential"}],"instructions":["Adjust rack to top position and preheat oven to 425 degrees. Wash and dry produce. • Cut potatoes into ½-inch-thick wedges. Halve, peel, and thinly slice onion.","Toss potatoes on a baking sheet with a drizzle of oil and half the Old Bay Seasoning (you’ll use more later). Season lightly with salt and pepper. TIP: No need to season generously— there’s already salt and pepper in the seasoning! • Roast on top rack until browned and crispy, 20-25 minutes.","While potatoes roast, heat a large drizzle of oil in a medium, preferably nonstick, pan over medium-high heat. Add onion; cook, stirring occasionally, until browned and softened, 8-10 minutes. • Add 1 tsp sugar (2 tsp for 4 servings) and a splash of water; cook until onion is caramelized and jammy, 2-3 minutes more. Season with salt and pepper. • Turn off heat; transfer to a small bowl.","Meanwhile, in a second small bowl, combine mayonnaise, ketchup, mustard, and as much remaining Old Bay Seasoning as you like. Set aside. • Form pork* into two equal-size balls (four balls for 4 servings); season all over with salt and pepper.\r\n\r\nSwap in for beef.","Heat a drizzle of oil in pan used for onion over medium-high heat. Once pan is hot, add pork. Firmly flatten each ball with a spatula to create very thin patties. (TIP: Do so carefully; oil may splatter a bit.) Cook until browned and cooked through, 4-7 minutes per side. (Don’t worry if the patties aren’t perfectly round—those irregular edges will turn crispy.) • In the last 1-2 minutes of cooking, top patties with cheddar; cover pan to melt cheese. Remove from heat.","While patties cook, halve and toast buns. • Divide buns between plates and fill with patties, caramelized onion, and half the special sauce. Serve burgers with Old Bay fries on the side and remaining special sauce for dipping."]},"about":"Serves 2. These burgers are sure to be a smash hit. The secret is all in the texture! The crispy, craggy edges, achieved when balls of ground pork are pressed down in a hot pan with a spatula to create super-thin, crispy burgers. Topped with gooey white cheddar, the patties are sandwiched between potato buns with caramelized onion and a homemade special sauce that’s also perfect for pairing with Old Bay fries on the side—and will elicit major “oohs” and “ahhs” from your dining companions.","id":6,"image":{"filename":"recipe_6.jpeg","type":"image/jpeg"}},{"title":"Meatballs & Creamy Onion Gravy","difficulty":"7","time":"40","details":{"ingredients":[{"name":"Potatoes","amount":"12 oz","type":"Essential"},{"name":"Onion","amount":"1 unit","type":"Essential"},{"name":"Sour Cream","amount":"3 tbsp","type":"Essential"},{"name":"Ground Beef","amount":"10 oz","type":"Essential"},{"name":"Pank Breadcrumbs","amount":"1/4 cup","type":"Essential"},{"name":"Garlic Powder","amount":"1 tsp","type":"Essential"},{"name":"Nutmeg","amount":"1 tsp","type":"Essential"},{"name":"Peas","amount":"4 oz","type":"Essential"},{"name":"Flour","amount":"1 tbsp","type":"Essential"},{"name":"Beef Stock Concentrates","amount":"2 tsp","type":"Essential"},{"name":"Cream Cheese","amount":"2 tbsp","type":"Essential"},{"name":"Cooking oil","amount":"2 tsp","type":"Essential"},{"name":"Butter","amount":"4 tbsp","type":"Essential"},{"name":"Salt","amount":"1","type":"Essential"},{"name":"Pepper","amount":"1","type":"Essential"}],"instructions":["Adjust rack to top position and preheat oven to 450 degrees. Wash and dry produce. • Dice potatoes into ½-inch pieces. Halve and peel onion; grate half the onion on the largest holes of a box grater. Thinly slice remaining onion. • Place potatoes in a medium pot with enough salted water to cover by 2 inches. Bring to a boil and cook until tender, 15-20 minutes. Reserve ½ cup potato cooking liquid (¾ cup for 4 servings), then drain. • Return potatoes to pot and mash with half the sour cream (you’ll use the rest later) and 2 TBSP butter (4 TBSP for 4) until smooth and creamy, adding splashes of reserved potato cooking liquid as needed. Season with salt and pepper. • Keep covered off heat until ready to serve.","While potatoes cook, in a large bowl, combine beef*, grated onion, panko, garlic powder, ¼ tsp nutmeg (½ tsp for 4 servings), salt (we used ¾ tsp, 1½ tsp for 4), and pepper. (You’ll use more nutmeg later.) • Form mixture into 10-12 1½-inch meatballs (20-24 meatballs for 4) and place on a lightly oiled baking sheet. • Roast on top rack until browned and cooked through, 14-16 minutes.","Meanwhile, melt 1 TBSP butter in a large pan over medium-high heat. Add peas and cook, undisturbed, until lightly browned, 2-3 minutes. • Stir peas. Cook, stirring occasionally, until lightly charred, 1-2 minutes more. • Turn off heat; transfer to a plate. Wipe out pan.","Heat a drizzle of oil in same pan over medium heat. Add sliced onion and a pinch of salt; cook, stirring occasionally, until onion is browned and softened, 3-6 minutes. • Add 1 TBSP butter (2 TBSP for 4 servings) and cook, whisking, until butter melts. • Sprinkle flour over onion; cook, whisking constantly, until lightly browned, 1-2 minutes."]},"about":"Serves 2. Calling all comfort food fans! Wait…who isn’t a fan?! This week’s selection ticks all of the feel-good boxes. Warmly spiced meatballs, à la Sweden, draped in rich and creamy onion sauce; check! Fluffy, sour cream mashed spuds and buttery, skillet charred peas; check, check! The only thing missing is your fave dining companion. And we won’t tell if you enjoy this meal in your PJs!","id":7,"image":{"filename":"recipe_7.jpeg","type":"image/jpeg"}},{"title":"One-Pan Santa Fe Pork Tacos","difficulty":"3","time":"25","details":{"ingredients":[{"name":"Onion","amount":"1 unit","type":"Essential"},{"name":"Cilantro","amount":"1/4 oz","type":"Optional"},{"name":"Lemon","amount":"1 unit","type":"Optional"},{"name":"Ground Pork","amount":"10 oz","type":"Alternatives","Alternatives":[{"name":"Chopped Chicken Breast","amount":"10 oz"},{"name":"Ground Beef","amount":"10 oz"}]},{"name":"Southwest Spice Blend","amount":"1 tbsp","type":"Essential"},{"name":"Shredded Red Cabbage","amount":"4 oz","type":"Optional"},{"name":"Mayonnaise","amount":"2 tbsp","type":"Optional"},{"name":"Tex-Mex Paste","amount":"1 tbsp","type":"Optional"},{"name":"Flour Tortillas","amount":"6 tortillas","type":"Essential"},{"name":"Monterey Jack Cheese","amount":"1/4 cup","type":"Optional"},{"name":"Sour Cream","amount":"1 1/2 tbsp","type":"Optional"}],"instructions":["Wash and dry produce. • Halve, peel, and finely dice onion. Finely chop cilantro.","Heat a drizzle of oil in a large pan over medium-high heat. Add onion and a pinch of salt; cook, stirring occasionally, until slightly softened and lightly browned, 2-3 minutes. • Add pork and Southwest Spice Blend. Cook, breaking up meat into pieces, until browned and cooked through, 4-6 minutes. TIP: If there’s excess grease in your pan, carefully pour it out.\r\n\r\nPat chicken dry with paper towels. Cook  through this step as instructed, swapping in chicken or beef for pork.","While pork cooks, in a large bowl, combine cabbage, mayonnaise, half the cilantro, half the vinegar (all for 4 servings), 1 tsp sugar (2 tsp for 4), and a pinch of salt and pepper.","Stir Tex-Mex paste into pan with pork mixture until fully coated. Taste and season with salt and pepper. Remove pan from heat. • Wrap tortillas in damp paper towels and microwave until warm and pliable, 30 seconds. • Divide tortillas between plates and fill with pork filling, Monterey Jack, slaw, sour cream, and remaining cilantro."]},"about":"Makes 6 tacos. We firmly believe taco night should be treated like a holiday—one that should be celebrated at LEAST once a week, if not more. If you agree, you’ve got to add this Southwest version to your repertoire. Spiced ground pork and onion are piled into steamy tortillas with Monterey Jack cheese, a tangy cilantro slaw, and sour cream. Taco ’bout an awesome meal.","id":8}]